[
  {
    "path": "research/1optionshft/",
    "title": "High-Frequency Trading in the Options Market and Order Flow Toxicity",
    "description": "Working Paper (Job Market Paper)",
    "author": [
      {
        "name": "Matthew Son",
        "url": {}
      }
    ],
    "date": "2022-08-24",
    "categories": [],
    "contents": "\n\n\n\nAbstract\nThe behavior and impact of HFTs in terms of market quality has mainly\nfocused on the stock market and options market have received less\nattention. Options exchanges identify high-frequency/algorithmic traders\nas Professional customers (PCs). In this study, we use a granular data\nthat identifies trades by customers, PCs, and Market makers (MMs). We\nfind that PCs mainly trade as a counterparty to customers, similar to\nMMs. However, the liquidity provision by PCs leads to order flow\ntoxicity: PCs use a “cream skimming” strategy that imposes adverse\nselection costs to MMs. PCs mainly trade with uninformed customers, and\nstrategically pick resting orders, most likely leveraging their speed\nadvantage. PCs provide less liquidity when the market and stock\nvolatility are high. Customer call option trades made with PCs have\none-tenth of price impact and no return or volatility predictability,\nwhile there are significant price impact in addition to return and\nvolatility predictability when executed against MMs during the next 30\nminutes. Our findings on HFTs’ non-arbitrage channel of order flow\ntoxicity is new and suggests that the role of HFTs should be better\nunderstood in the context of the options market structure.\n\n\n\n",
    "preview": "research/1optionshft/distill-preview.png",
    "last_modified": "2022-08-24T23:01:40-04:00",
    "input_file": {}
  },
  {
    "path": "research/2networkmf/",
    "title": "It is Better to be Yourself: A Network Analysis on Mutual Fund Distinctiveness and Performance",
    "description": "Working Paper",
    "author": [
      {
        "name": "Matthew Son",
        "url": {}
      }
    ],
    "date": "2022-08-24",
    "categories": [],
    "contents": "\n\n\n\nAbstract\nIn this study, we analyze the information content of active mutual\nfund holdings using a network model. By analyzing 48 million of fund\nnetwork connections, we document two main findings: First, we find a\nstrong association between portfolio distinctiveness and its long-term\nrisk-adjusted return. We measure funds’ distinctiveness in two\ndimensions: centrality and clusteredness. The centrality measures the\noverall commonness of a fund’s portfolio, while clusteredness measures\nhow strongly a fund is forming a clique (localized strategy).We find\nfunds that hold assets commonly held by others (high centrality)\nunderperform by 60bps, while funds with localized and distinctive\nportfolio (high clusteredness) outperform 140 bps in a year. Second, we\nfind effect of peer competition that monotonically harms the fund’s\nperformance. Funds that are located in lowest quintile of competition\noutperforms 240bps in a year compared to top quintile funds. All results\nhold significance for more than 24 months. Our network-based approach\novercomes potential confounding effects from style misclassifications\nand mixed-style funds.\n\n\n\n",
    "preview": "research/2networkmf/distill-preview.png",
    "last_modified": "2022-08-24T23:03:46-04:00",
    "input_file": {}
  },
  {
    "path": "research/3options_ml/",
    "title": "An Efficient Estimate of Closing Option Price using Machine Learning",
    "description": "Work-in-progress Paper",
    "author": [
      {
        "name": "Alejandro Lopez- Lira",
        "url": {}
      },
      {
        "name": "Mahendrajah Nimalendran",
        "url": {}
      },
      {
        "name": "Matthew Son",
        "url": {}
      }
    ],
    "date": "2022-08-24",
    "categories": [],
    "contents": "\n\n\n\nAbstract\nU.S. stock exchanges have closing auctions that generate robust\nbenchmark closing prices; however, options markets do not have closing\nauctions. Exchanges and brokerages use mid-quote at close and funds use\nthe last trade as the benchmark price. The closing quotes are noisy\nbecause the options trading near the market close is very volatile. In\nthis study, we estimate a more robust and efficient closing option price\nusing the closing stock price with a machine learning model. We consider\nseveral machine learning algorithms: Gradient Boosting Machine (GBM),\nExtreme gradient boosting, Random forest, Deep learning, and Elastic\nnet. We obtain a reliable option price estimator by combining\nBlack-Scholes option prices and the machine learning algorithm (GBM),\nwith an out-of-sample r-squared of 99.8%. We test the reliability of our\nestimate and analyze the price discrepancy between the 4pm mid-quote and\nour estimates. Unlike stocks, most (75%) of estimated options’ closing\nprices lie within the bid-ask spread, likely due to the wide option\nspreads at the close. We find that the price deviation of the ML\nestimate and mid-quote at the close is particularly large for 1) large\nfirms, 2) out-of-the-money options, and 3) short expiration options.\nFormal regression tests show consistent results that options that are\nactively traded, and that have larger spreads exhibit greater\ndeviations. Our result shed light on the validity of using the\nend-of-day mid-quote as a benchmark option price.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-08-24T23:07:02-04:00",
    "input_file": "options_ml.knit.md"
  }
]
